{"keras_version": "1.2.1", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "trainable": true, "output_shape": null, "name": "INPUT", "input_dtype": "float32", "output_shape_type": "raw", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bclone.py\u00da\b<lambda>-\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"trainable": true, "name": "cropping2d_1", "cropping": [[70, 25], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"dim_ordering": "tf", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "trainable": true, "name": "convolution2d_1", "init": "glorot_uniform", "nb_filter": 24, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "trainable": true, "name": "convolution2d_2", "init": "glorot_uniform", "nb_filter": 36, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "trainable": true, "name": "convolution2d_3", "init": "glorot_uniform", "nb_filter": 48, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true, "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_row": 3, "border_mode": "valid", "nb_col": 3, "trainable": true, "name": "convolution2d_4", "init": "glorot_uniform", "nb_filter": 64, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_row": 3, "border_mode": "valid", "nb_col": 3, "trainable": true, "name": "convolution2d_5", "init": "glorot_uniform", "nb_filter": 64, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 2112, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 100, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 100, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 50, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 50, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 10, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 10, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 1, "name": "OUTPUT"}, "class_name": "Dense"}], "class_name": "Sequential"}