{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "trainable": true, "name": "INPUT", "output_shape_type": "raw", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bclone.py\u00da\b<lambda>-\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": true, "cropping": [[70, 25], [0, 0]]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "nb_col": 5, "nb_row": 5, "trainable": true, "name": "convolution2d_1", "activation": "relu", "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 24, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "nb_col": 5, "nb_row": 5, "trainable": true, "name": "convolution2d_2", "activation": "relu", "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 36, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "nb_col": 5, "nb_row": 5, "trainable": true, "name": "convolution2d_3", "activation": "relu", "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 48, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3, "trainable": true, "name": "convolution2d_4", "activation": "relu", "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "nb_col": 3, "nb_row": 3, "trainable": true, "name": "convolution2d_5", "activation": "relu", "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "activation": "linear", "bias": true, "input_dim": 2112, "init": "glorot_uniform", "trainable": true, "name": "dense_1", "W_constraint": null, "output_dim": 100, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "activation": "linear", "bias": true, "input_dim": 100, "init": "glorot_uniform", "trainable": true, "name": "dense_2", "W_constraint": null, "output_dim": 50, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "activation": "linear", "bias": true, "input_dim": 50, "init": "glorot_uniform", "trainable": true, "name": "dense_3", "W_constraint": null, "output_dim": 10, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "activation": "linear", "bias": true, "input_dim": 10, "init": "glorot_uniform", "trainable": true, "name": "OUTPUT", "W_constraint": null, "output_dim": 1, "b_constraint": null, "W_regularizer": null}}], "keras_version": "1.2.1"}