{"config": [{"config": {"output_shape_type": "raw", "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bclone.py\u00da\b<lambda>.\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "name": "INPUT", "arguments": {}, "trainable": true, "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"name": "cropping2d_1", "cropping": [[70, 25], [0, 0]], "trainable": true}, "class_name": "Cropping2D"}, {"config": {"subsample": [2, 2], "activation": "relu", "border_mode": "valid", "nb_col": 5, "name": "convolution2d_1", "nb_filter": 24, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "activation": "relu", "border_mode": "valid", "nb_col": 5, "name": "convolution2d_2", "nb_filter": 36, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "activation": "relu", "border_mode": "valid", "nb_col": 5, "name": "convolution2d_3", "nb_filter": 48, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "activation": "relu", "border_mode": "valid", "nb_col": 3, "name": "convolution2d_4", "nb_filter": 64, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "activation": "relu", "border_mode": "valid", "nb_col": 3, "name": "convolution2d_5", "nb_filter": 64, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "name": "dense_1", "input_dim": 2112, "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"output_dim": 50, "name": "dense_2", "input_dim": 100, "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"output_dim": 10, "name": "dense_3", "input_dim": 50, "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"output_dim": 1, "name": "OUTPUT", "input_dim": 10, "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}